Revit 2027 API
WallSweepType Enumeration
 Represents the possible types for methods affecting wall sweeps or reveals.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WallSweepType
Public Enumeration WallSweepType
public enum class WallSweepType
type WallSweepType
Members
Member name | Value | Description
Reveal | 1 |  Represents a reveal.
Sweep | 0 |  Represents a wall sweep.
See Also
Reference
Autodesk.Revit.DB Namespace